sergioamr/vaccinemonitoring/tempsensor_v1/third_party_libs/driverlib/MSP430FR5xx_6xx/comp_e.h
//*****************************************************************************
//
//! \brief Disables the short of the two input pins chosen during
//! initialization.
//!
//! This function clears the bit that shorts the devices attached to the input
//! pins chosen from the initialization of the Comp_E.
//!
//! \param baseAddress is the base address of the COMP_E module.
//!
//! Modified bits are \b CESHORT of \b CECTL1 register.
//!
//! \return None
//
//*****************************************************************************
extern void Comp_E_unshortInputs(uint16_t baseAddress);

//*****************************************************************************
//
//! \brief Disables the input buffer of the selected input port to effectively
//! allow for analog signals.
//!
//! This function sets the bit to disable the buffer for the specified input
//! port to allow for analog signals from any of the Comp_E input pins. This
//! bit is automatically set when the input is initialized to be used with the
//! Comp_E module. This function should be used whenever an analog input is
//! connected to one of these pins to prevent parasitic voltage from causing
//! unexpected results.
//!
//! \param baseAddress is the base address of the COMP_E module.
//! \param inputPort is the port in which the input buffer will be disabled.
//!        Mask value is the logical OR of any of the following:
//!        - \b COMP_E_INPUT0 [Default]
//!        - \b COMP_E_INPUT1
//!        - \b COMP_E_INPUT2
//!        - \b COMP_E_INPUT3
//!        - \b COMP_E_INPUT4
//!        - \b COMP_E_INPUT5
//!        - \b COMP_E_INPUT6
//!        - \b COMP_E_INPUT7
//!        - \b COMP_E_INPUT8
//!        - \b COMP_E_INPUT9
//!        - \b COMP_E_INPUT10
//!        - \b COMP_E_INPUT11
//!        - \b COMP_E_INPUT12
//!        - \b COMP_E_INPUT13
//!        - \b COMP_E_INPUT14
//!        - \b COMP_E_INPUT15
//!        - \b COMP_E_VREF
//!        \n Modified bits are \b CEPDx of \b CECTL3 register.
//!
//! \return None
//
//*****************************************************************************
extern void Comp_E_disableInputBuffer(uint16_t baseAddress,
                                      uint16_t inputPort);

//*****************************************************************************
//
//! \brief Enables the input buffer of the selected input port to allow for
//! digital signals.
//!
//! This function clears the bit to enable the buffer for the specified input
//! port to allow for digital signals from any of the Comp_E input pins. This
//! should not be reset if there is an analog signal connected to the specified
//! input pin to prevent from unexpected results.
//!
//! \param baseAddress is the base address of the COMP_E module.
//! \param inputPort is the port in which the input buffer will be enabled.
//!        Mask value is the logical OR of any of the following:
//!        - \b COMP_E_INPUT0 [Default]
//!        - \b COMP_E_INPUT1
//!        - \b COMP_E_INPUT2
//!        - \b COMP_E_INPUT3
//!        - \b COMP_E_INPUT4
//!        - \b COMP_E_INPUT5
//!        - \b COMP_E_INPUT6
//!        - \b COMP_E_INPUT7
//!        - \b COMP_E_INPUT8
//!        - \b COMP_E_INPUT9
//!        - \b COMP_E_INPUT10
//!        - \b COMP_E_INPUT11
//!        - \b COMP_E_INPUT12
//!        - \b COMP_E_INPUT13
//!        - \b COMP_E_INPUT14
//!        - \b COMP_E_INPUT15
//!        - \b COMP_E_VREF
//!        \n Modified bits are \b CEPDx of \b CECTL3 register.
//!
//! \return None
//
//*****************************************************************************
extern void Comp_E_enableInputBuffer(uint16_t baseAddress,
                                     uint16_t inputPort);

//*****************************************************************************
//
//! \brief Toggles the bit that swaps which terminals the inputs go to, while
//! also inverting the output of the Comp_E.
//!
//! This function toggles the bit that controls which input goes to which
//! terminal. After initialization, this bit is set to 0, after toggling it
//! once the inputs are routed to the opposite terminal and the output is
//! inverted.
//!
//! \param baseAddress is the base address of the COMP_E module.
//!
//! \return None
//
//*****************************************************************************
extern void Comp_E_IOSwap(uint16_t baseAddress);

//*****************************************************************************
//
//! \brief Returns the output value of the Comp_E module.
//!
//! Returns the output value of the Comp_E module.
//!
//! \param baseAddress is the base address of the COMP_E module.
//!
//! \return One of the following:
//!         - \b Comp_E_LOW
//!         - \b Comp_E_HIGH
//!         \n indicating the output value of the Comp_E module
//
//*****************************************************************************
extern uint16_t Comp_E_outputValue(uint16_t baseAddress);

//*****************************************************************************
//
// The Comp_E_init() API has been deprecated. Instead please use the
// Comp_E_initialize() API.
//
//*****************************************************************************
#ifndef DEPRECATED
extern bool Comp_E_init(uint16_t baseAddress,
                        uint16_t posTerminalInput,
                        uint16_t negTerminalInput,
                        uint8_t outputFilterEnableAndDelayLevel,
                        uint16_t invertedOutputPolarity);
#endif

//*****************************************************************************
//
// DEPRECATED
//
//*****************************************************************************
#define COMP_E_INTERRUPT_FLAG                                           (CEIFG)
#define COMP_E_VREFBASE_VCC                                          (CEREFL_0)

//*****************************************************************************
//
// The following are deprecated API names. These were updated to new names to
// add compatibility across Texas Instruments microcontrollers.
//
//*****************************************************************************
#ifndef DEPRECATED
#define COMP_E___getRegisterSettingForInput Comp_E___getRegisterSettingForInput
#define COMP_E_init                                                 Comp_E_init
#define COMP_E_initialize                                     Comp_E_initialize
#define COMP_E_setReferenceVoltage                   Comp_E_setReferenceVoltage
#define COMP_E_setReferenceAccuracy                 Comp_E_setReferenceAccuracy
#define COMP_E_setPowerMode                                 Comp_E_setPowerMode
#define COMP_E_enableInterrupt                           Comp_E_enableInterrupt
#define COMP_E_disableInterrupt                         Comp_E_disableInterrupt
#define COMP_E_clearInterrupt                             Comp_E_clearInterrupt
#define COMP_E_getInterruptStatus                     Comp_E_getInterruptStatus
#define COMP_E_interruptSetEdgeDirection       Comp_E_interruptSetEdgeDirection
#define COMP_E_interruptToggleEdgeDirection Comp_E_interruptToggleEdgeDirection
#define COMP_E_enable                                             Comp_E_enable
#define COMP_E_disable                                           Comp_E_disable
#define COMP_E_shortInputs                                   Comp_E_shortInputs
#define COMP_E_unshortInputs                               Comp_E_unshortInputs
#define COMP_E_disableInputBuffer                     Comp_E_disableInputBuffer
#define COMP_E_enableInputBuffer                       Comp_E_enableInputBuffer
#define COMP_E_IOSwap                                             Comp_E_IOSwap
#define COMP_E_outputValue                                   Comp_E_outputValue
#endif

//*****************************************************************************
//
// The following are deprecated struct names. These were updated to new names
// to add compatibility across Texas Instruments microcontrollers.
//
//*****************************************************************************
#ifndef DEPRECATED
#define COMP_E_initializeParam                           Comp_E_initializeParam
#endif

//*****************************************************************************
//
// Mark the end of the C bindings section for C++ compilers.
//
//*****************************************************************************
#ifdef __cplusplus
}
#endif

#endif
#endif // __MSP430WARE_COMP_E_H__
